---
kind: property
id: P:Autodesk.Revit.DB.Electrical.TemperatureRatingType.CorrectionFactors
source: html/e0b0df88-e174-3f9d-c33a-5a7f510a4c3a.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingType.CorrectionFactors Property

Get all correction factors defined in this temperature rating type and its corresponding material type.

## Syntax (C#)
```csharp
public CorrectionFactorSet CorrectionFactors { get; }
```